# Запрашиваем у пользователя первое число
num1 = float(input("Введите первое число: "))

# Запрашиваем у пользователя второе число
num2 = float(input("Введите второе число: "))

# Сумма чисел
sum = num1 + num2
print("Сумма:", sum)

# Разность чисел
diff = num1 - num2
print("Разность:", diff)

# Произведение чисел
prod = num1 * num2
print("Произведение:", prod)

# Частное чисел
if num2 != 0:
    div = num1 / num2
    print("Частное:", div)
else:
    print("Деление на ноль недопустимо")

# Возведение первого числа в степень второго числа
power = num1 ** num2
print("Возведение в степень:", power)
